xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
/* Context for the Xively Connection */
xi_context_handle_t gXivelyContextHandle = -1;


/****************************************************************************
 *                      FUNCTION PROTOTYPES
 *****************************************************************************/

/* Xively Functions */
void ConnectToXively();
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state );
void send_fileinfo( const xi_context_handle_t context_handle, const xi_timed_task_handle_t timed_task_handle,
                    void* user_data );
void pushButtonInterruptHandlerSW2();
void pushButtonInterruptHandlerSW3();

/* Xively and Wifi Config File Parsing functions */
static void parseCredentialsFromConfigFile();
static int8_t parseKeyValue( config_entry_t* config_file_context, const char* key,
                             const uint8_t is_required, char** out_value );
static int8_t mapWifiSecurityTypeStringToInt( const char* security_type );

/* Xively and Wifi Config value verification functions */
static int8_t validateWifiConfigurationVariables( const char* wifi_ssid,
                                                  const char* wifi_password,
                                                  const char* wifi_security_type );

static int8_t validateXivelyCredentialBufferRequirement( const char* config_key,
                                                         const char* value );

/* CCS requirement */
extern void ( *const g_pfnVectors[] )( void );

/* Device and Simplelink WiFi Provisioning Functions */
long MainLogic();
void WaitForWlanEvent();
static void BoardInit( void );
static void InitializeAppVariables();
static long ConfigureSimpleLinkToDefaultState();

/****************************************************************************
 *                               Source!
 *****************************************************************************/

/**
 * @brief Main Application entry point.
 *
 * Initializes board and then calls MainLogic
 * for Wifi Provisioning and connecting to Xively
 */
int main()
{
    long lRetVal = -1;

    /* Initialize Board configurations */
    BoardInit();
    PinMuxConfig();

    /* configure RED and Green LED */
    GPIO_IF_LedConfigure( LED1 | LED2 | LED3 );

#ifndef NOTERM
    InitTerm();
    ClearTerm();
#endif

    lRetVal = MainLogic();

    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
    }

    LOOP_FOREVER();
}

/**
 * @brief Driver for the xively library logic
 *
 * This function creates a xively context and starts the internal event
 * dispatcher and event processing of Xively library.
 *
 */
void ConnectToXively()
{
    /* Register Push Button Handlers */
    Button_IF_Init( pushButtonInterruptHandlerSW2, pushButtonInterruptHandlerSW3 );

    /* Make the buttons to react on both press and release events */
    MAP_GPIOIntTypeSet( GPIOA1_BASE, GPIO_PIN_5, GPIO_BOTH_EDGES );
    MAP_GPIOIntTypeSet( GPIOA2_BASE, GPIO_PIN_6, GPIO_BOTH_EDGES );

    /* Disable the interrupt for now */
    Button_IF_DisableInterrupt( SW2 | SW3 );

    xi_state_t ret_state = xi_initialize( g_wifi_device_credentials.xivelyAccountId,
                                          g_wifi_device_credentials.xivelyDeviceId, 0 );

    if ( XI_STATE_OK != ret_state )
    {
        printf( "xi failed to initialise\n" );
        return;
    }

    gXivelyContextHandle = xi_create_context();

    if ( XI_INVALID_CONTEXT_HANDLE == gXivelyContextHandle )
    {
        printf( " xi failed to create context, error: %d\n",
                           -gXivelyContextHandle );
        return;
    }

    xi_state_t connect_result =
        xi_connect( gXivelyContextHandle, g_wifi_device_credentials.xivelyDeviceId,
                    g_wifi_device_credentials.xivelyDevicePassword, 10, 0,
                    XI_SESSION_CLEAN, &on_connected );

    /* start processing xively library events */
    xi_events_process_blocking();

    /* when the event dispatcher is stop destroy the context */
    xi_delete_context( gXivelyContextHandle );

    /* shutdown the xively library */
    xi_shutdown();
}


void send_fileinfo( const xi_context_handle_t context_handle,
                    const xi_timed_task_handle_t timed_task_handle,
                    void* user_data )
{
    /* guard against multiple sends */
    static int sent = 0;
    if( ! sent )
    {
        xi_publish_file_info( context_handle );
        sent = 1;
    }
}


/**
* @brief Event handler for SW2 button press/release interrupts.
 *
 * The pinValue will be 1 on a button press event, 0 on button up..
 */
void pushButtonInterruptHandlerSW2()
{
    if ( GPIOPinRead( GPIOA2_BASE, GPIO_PIN_6 ) != 0 )
    {
        if ( XI_INVALID_TIMED_TASK_HANDLE ==
                xi_schedule_timed_task( gXivelyContextHandle, send_fileinfo, 1, 0, NULL ) )
        {
            printf( "send_file_info couldn't be registered\n" );
        }
    }

    Button_IF_EnableInterrupt( SW2 );
}

/**
 * @brief Event handler for SW2 button press/release interrupts.
 *
 * The pinValue will be 1 on a button press event, 0 on button up.
 */
void pushButtonInterruptHandlerSW3()
{
    Button_IF_EnableInterrupt( SW3 );
}

/**
 * @brief Function that handles messages sent to the device on the `blink` topic.
 *
 * @note For more details please refer to the xively.h - xi_subscribe function.
 *
 * @param in_context_handle - xively library context required for calling API functions
 * @param call_type - describes if the handler was called carrying the subscription
 * operation result or the incoming message
 * @oaram params - structure with data
 * @param state - state of the operation
 * @oaram user_data - optional data, in this case nothing.
 */
void on_blink_topic( xi_context_handle_t in_context_handle,
                     xi_sub_call_type_t call_type,
                     const xi_sub_call_params_t* const params,
                     xi_state_t state,
                     void* user_data )
{
    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                printf( "topic:%s. Subscription failed.\n", params->suback.topic );
            }
            else
            {
                printf( "topic:%s. Subscription granted %d.\n", params->suback.topic,
                        ( int )params->suback.suback_status );
            }
            return;
        case XI_SUB_CALL_MESSAGE:
        {
            static int toggle_lights = 0;
            toggle_lights = (toggle_lights + 1) % 2;

            if( toggle_lights )
            {
               GPIO_IF_LedOn( MCU_GREEN_LED_GPIO );
               GPIO_IF_LedOn( MCU_ORANGE_LED_GPIO );
            }
            else
            {
                GPIO_IF_LedOff( MCU_GREEN_LED_GPIO );
                GPIO_IF_LedOff( MCU_ORANGE_LED_GPIO );
            }
            return;
        }
    }
}

