xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
/*
 * @brief Subscribes to a topic given a channel (topic suffix) and a callback.
 * See xively.h for full signature information of callbacks.
 *
 * @param in_context_handle the Xively connection context as was returned from
 * xi_create_context, and passed in from the connection callback on_connected().
 * This value must be used in all further Xively operations, including subscription
 * requests (below.)
 * @param channel a string to append to the end of the topic base string.  General
 * topic structure is:  xi/blue/v1/{accountId}/d/{deviceId}/{channel}.
 * @param callback a pointer to the callback function that handles subscription
 * status updates and incoming messages on the topic.  For this example application
 * this is on_led_topic as specified in the invocation of this function in
 * on_connected() (above.)
 * @param user_data an abstract data pointer that can be anything, and will be
 * passed to the subscription handler on all invocations.  In this case the GPIO
 * index of the corresponding LED is provided. We use this to easily associate a topic
 * with an LED, without having to parse the full topic name.
 * @retval xi_state_t which is the success / failure code of the xi_subscription request.
 * Since the actual subscription response from the service occurs asynchronously, this
 * value represents if the subscription request was properly queued by the Xively Client,
 * and does not reflect the SUBACK value of the subscription request itself.
 */
xi_state_t subscribe_to_topic( xi_context_handle_t context_handle,
                               const char* channel,
                               xi_user_subscription_callback_t* callback,
                               void* user_data )
{
    char topic_name[XIVELY_TOPIC_LEN];
    memset( topic_name, '\0', XIVELY_TOPIC_LEN );

    snprintf( topic_name, XIVELY_TOPIC_LEN, XIVELY_TOPIC_FORMAT,
              g_wifi_device_credentials.xivelyAccountId,
              g_wifi_device_credentials.xivelyDeviceId, channel );

    return xi_subscribe( context_handle, topic_name, XI_MQTT_QOS_AT_MOST_ONCE, callback,
                         user_data );
}

/**
 * @brief Handler function for event a related to changes in connection state.
 *
 * @note for more details please refer to xively.h - xi_connect function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param data - points to the structure that holds detailed information about the
 * xively libarry's connection state and settings
 * @param state - additional internal state of the library helps to determine the reason
 * of connection failure or disconnection
 */
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state )
{
    xi_connection_data_t* conn_data = ( xi_connection_data_t* )data;

    switch ( conn_data->connection_state )
    {
        case XI_CONNECTION_STATE_OPEN_FAILED:
            XIVELY_DEMO_PRINT( "connection to %s:%d has failed reason %d\n",
                               conn_data->host, conn_data->port, state );

            xi_connect( in_context_handle, conn_data->username, conn_data->password,
                        conn_data->connection_timeout, conn_data->keepalive_timeout,
                        conn_data->session_type, &on_connected );

            return;
        case XI_CONNECTION_STATE_OPENED:
            XIVELY_DEMO_PRINT( "connected to %s:%d\n", conn_data->host, conn_data->port );

            subscribe_to_topic( in_context_handle, "blink", on_blink_topic, NULL );

            xi_sft_init( in_context_handle, g_wifi_device_credentials.xivelyAccountId,
                         g_wifi_device_credentials.xivelyDeviceId );

            /* enable the button interrupts */
            Button_IF_EnableInterrupt( SW2 | SW3 );

            break;
        case XI_CONNECTION_STATE_CLOSED:
            XIVELY_DEMO_PRINT( "connection closed - reason %d!\n", state );

            /* disable button interrupts so the messages for button push/release events
             * won't be sent */
            Button_IF_DisableInterrupt( SW2 | SW3 );

            /* check if the close was due to the user's request */
            if ( XI_STATE_OK == state )
            {
                xi_events_stop();
            }
            else
            {
                WaitForWlanEvent();

                xi_connect( in_context_handle, conn_data->username, conn_data->password,
                            conn_data->connection_timeout, conn_data->keepalive_timeout,
                            conn_data->session_type, &on_connected );
            }
            return;
        default:
            XIVELY_DEMO_PRINT( "invalid parameter %d\n", conn_data->connection_state );
            return;
    }
}

/**
 * @brief Function that is required by TLS library to track the current time.
 */
time_t XTIME( time_t* timer )
{
    return xi_bsp_time_getcurrenttime_seconds();
}

/**
 * @brief Function required by the TLS library.
 */
uint32_t xively_ssl_rand_generate()
{
    return xi_bsp_rng_get();
}


/******************************************************************************
          SimpleLink Network Provisioning and Connection Code
******************************************************************************/

long MainLogic()
{
    SlSecParams_t g_SecParams;
    long lRetVal          = -1;
    unsigned char pValues = 0;

    InitializeAppVariables();

    lRetVal = ConfigureSimpleLinkToDefaultState();
    if ( lRetVal < 0 )
    {
        if ( DEVICE_NOT_IN_STATION_MODE == lRetVal )
            XIVELY_DEMO_PRINT( "Failed to configure the device "
                               "in its default state \n" );

        return lRetVal;
    }

    CLR_STATUS_BIT_ALL( g_ulStatus );

    /* Start simplelink */
    lRetVal = sl_Start( 0, 0, 0 );
    if ( lRetVal < 0 || ROLE_STA != lRetVal )
    {
        XIVELY_DEMO_PRINT( "Failed to start the device \n" );
        return lRetVal;
    }

    memset( &g_wifi_device_credentials, 0, sizeof( g_wifi_device_credentials ) );
    parseCredentialsFromConfigFile();

    /* start ent wlan connection */
    g_SecParams.Key    = g_wifi_device_credentials.desiredWifiKey;
    g_SecParams.KeyLen = strlen( ( const char* )g_wifi_device_credentials.desiredWifiKey );
    g_SecParams.Type   = g_wifi_device_credentials.desiredWifiSecurityType;

    /* 0 - Disable the server authnetication | 1 - Enable (this is the default) */
    pValues = 0;
    sl_WlanSet( SL_WLAN_CFG_GENERAL_PARAM_ID, 19, 1, &pValues );

    /* add the wlan profile */
    sl_WlanProfileAdd( g_wifi_device_credentials.desiredWifiSSID,
                       strlen( g_wifi_device_credentials.desiredWifiSSID ), 0, &g_SecParams, 0, 1, 0 );

    /* set the connection policy to auto */
    pValues = 0;
    sl_WlanPolicySet( SL_POLICY_CONNECTION, SL_CONNECTION_POLICY( 1, 1, 0, 0, 0 ),
                      &pValues, 1 );

    /* wait for the WiFi connection */
    WaitForWlanEvent();

    /* this is where the connection to Xively Broker can be established */
    ConnectToXively();

