xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
    /* wait for few moments */
    MAP_UtilsDelay( 80000000 );

    /* Disconnect from network */
    lRetVal = sl_WlanDisconnect();

    /* power off the network processor */
    lRetVal = sl_Stop( SL_STOP_TIMEOUT );

    return 0;
}


/* @brief Retrieves Wifi Credential and Xively Credential information from a configuration
 * file stored on the Flash File System of the device.
 *
 * Invokes the configuration file parser in config_file.h / config_file.c for file
 * operations and for parsing the key value pairs.
 *
 * Ensures that all required credentials exist in the file and that they fit into the
 * Application control block buffers.  Additionally the wifi security
 * type is mapped to an existing CC3220 Simple Link Enumeration.
 *
 * If any validation fails then this function logs an error to the console
 * and loops forever, since any configuration error will prevent the application
 * from connecting to wifi and/or the xively service.
 */
void parseCredentialsFromConfigFile()
{
#if 0
    const char* config_file =
                    "\"account_id\": \"223151b6-7476-4832-b189-e52def8c6a7e\"\n\"device_id\": \"4cf1c080-78c1-4d9a-bd4d-164c1718cc67\"\n\"password\": \"wsvM295gDlnXBWVoUDpUAaIQtiXuCAkFuRqsfWiB8mo=\"\n\"wifi_security_type\": \"wpa2\"\n\"wifi_ssid\": \"LMI-GUEST\"\n\"wifi_password\": \"21SimplyPossible!\"\n";

    int32_t fd = 0;
    int file_length = strlen( config_file ) + 256;
    printf("file length: %d\n", file_length );
    int result = sl_FsOpen( XIVELY_CFG_FILE, FS_MODE_OPEN_CREATE( file_length,
                                                                  _FS_FILE_OPEN_FLAG_COMMIT | _FS_FILE_PUBLIC_WRITE ), NULL, &fd );
    if( 0 != result )
    {
        printf("could not open file to write, filename: %s error: %d\n", XIVELY_CFG_FILE, result );
        return;
    }
    else
    {

        result = sl_FsWrite( fd, 0, config_file, strlen( config_file ) );

        printf("Write result: %d  size of buffer: %d\n", result, file_length );
        result = sl_FsClose( fd, 0, 0, 0 );
        printf("Close result: %d\n", result );
    }
#endif

    config_entry_t* config_file_context;
    int err = read_config_file( XIVELY_CFG_FILE, &config_file_context );
    if ( err )
    {


        printf( ". Reading %s config file failed. returned %d\n\r", XIVELY_CFG_FILE, err );
        if ( SL_FS_ERR_FILE_NOT_EXISTS == err )
        {
            Report( ". File does not exist on flash file system.\n\r" );
        }
        Report( ". Cannot recover from error.\n\r" );
#if 1
        Report( ". Looping forever.\n\r" );
        while ( 1 )
            ;
#else
        printf("using default credentials\n");
        g_wifi_device_credentials.desiredWifiSecurityType = mapWifiSecurityTypeStringToInt( "wpa2" );

        memcpy( g_wifi_device_credentials.desiredWifiSSID, ENT_NAME, strlen( ENT_NAME ) );
        memcpy( g_wifi_device_credentials.desiredWifiKey, PASSWORD,
                strlen( PASSWORD ) );
        memcpy( g_wifi_device_credentials.xivelyAccountId, XIVELY_ACCOUNT_ID,
                strlen( XIVELY_ACCOUNT_ID) );
        memcpy( g_wifi_device_credentials.xivelyDeviceId, XIVELY_DEVICE_ID,
                strlen( XIVELY_DEVICE_ID ) );
        memcpy( g_wifi_device_credentials.xivelyDevicePassword, XIVELY_DEVICE_SECRET,
                strlen( XIVELY_DEVICE_SECRET ) );
        printf("returning\n");
        return;
#endif
    }

    printf("parsing\n");
    /* parse wifi credentials from config file */
    static char *wifi_ssid = NULL, *wifi_security_type = NULL, *wifi_password = NULL;

    err |= parseKeyValue( config_file_context, WIFI_SSID_KEY, 1, &wifi_ssid );
    err |=
        parseKeyValue( config_file_context, WIFI_SEC_TYPE_KEY, 1, &wifi_security_type );
    err |= parseKeyValue( config_file_context, WIFI_PASSWORD_KEY, 1, &wifi_password );

    /* parse Xively account & device credentials from config file */
    static char *xively_account_id = NULL, *xively_device_id = NULL,
                *xively_device_password = NULL;
    err |= parseKeyValue( config_file_context, XIVELY_ACNT_KEY, 1, &xively_account_id );
    err |= parseKeyValue( config_file_context, XIVELY_DEV_KEY, 1, &xively_device_id );
    err |=
        parseKeyValue( config_file_context, XIVELY_PWD_KEY, 1, &xively_device_password );

    /* optional - parse xively broker address and port from config file */
    static char *broker_name = NULL, *broker_port_str = NULL;
    if ( 0 != parseKeyValue( config_file_context, XIVELY_HOST_KEY, 0, &broker_name ) )
    {
        broker_name = XIVELY_DEFAULT_BROKER;
    }

    static uint16_t broker_port = XIVELY_DEFAULT_PORT;
    if ( 0 == parseKeyValue( config_file_context, XIVELY_PORT_KEY, 0, &broker_port_str ) )
    {
        if ( 0 == ( broker_port = atoi( broker_port_str ) ) )
        {
            printf( ". \"%s\" value \"%s\" is an invalid \"port\" value\n",
                    XIVELY_PORT_KEY, broker_port_str );
            err = -1;
        }
    }

    /* if everything is ok so far then do some sanity checks on the string sizes and the
     * parsed values. */
    if ( !err )
    {
        err |= validateWifiConfigurationVariables( wifi_ssid, wifi_password,
                                                   wifi_security_type );

        err |= validateXivelyCredentialBufferRequirement( XIVELY_ACNT_KEY,
                                                          xively_account_id );
        err |=
            validateXivelyCredentialBufferRequirement( XIVELY_DEV_KEY, xively_device_id );
        err |= validateXivelyCredentialBufferRequirement( XIVELY_PWD_KEY,
                                                          xively_device_password );
    }

    /* one last check before we start copying memory around */
    if ( err )
    {
        printf( "\n\rCritical configuration error(s) found when parsing configuration "
                "file\n\r" );
        printf( "Looping forever.\n\r" );
        while ( 1 )
            ;
    }

    /* assign the variables into the Application Control Block. */
    g_wifi_device_credentials.desiredWifiSecurityType = mapWifiSecurityTypeStringToInt( ( const char* ) wifi_security_type );

    memcpy( g_wifi_device_credentials.desiredWifiSSID, wifi_ssid, strlen( wifi_ssid ) );
    memcpy( g_wifi_device_credentials.desiredWifiKey, wifi_password,
            strlen( wifi_password ) );
    memcpy( g_wifi_device_credentials.xivelyAccountId, xively_account_id,
            strlen( xively_account_id ) );
    memcpy( g_wifi_device_credentials.xivelyDeviceId, xively_device_id,
            strlen( xively_device_id ) );
    memcpy( g_wifi_device_credentials.xivelyDevicePassword, xively_device_password,
            strlen( xively_device_password ) );

    free_config_entries( config_file_context );
}

/* @brief helper function that uses the config_file parser to parse a value for the
 * provided key.
 *
 * @param config_file_context this value returned from the creation of the config_file
 * parser.
 * This context is required for all config_file operations.
 * @param key a string to use as a lookup key for the key/value pairs in the config file.
 * @param is_required when set to a non-zero value, an error will be logged to the console
 * if the
 * specified key could not be found in the configuration file.  This does not effect the
 * return value
 * of this function.
 * @retval 0 on successful parse of parameter. -1 if parameter does not exist in the
 * configuration file,
 * or if another error has occurred.
 */
int8_t parseKeyValue( config_entry_t* config_file_context,
                      const char* key,
                      const uint8_t is_required,
                      char** out_value )
{
    int8_t retVal = 0;
    if ( NULL == out_value )
    {
        printf( "parseRequiredKeyValue error: out_value parameter is NULL!\n\r" );
        retVal = -1;
    }
    else if ( NULL == key )
    {
        printf( "parseRequiredKeyValue error: in_key parameter is NULL!\n\r" );
        retVal = -1;
    }
    else
    {
        *out_value = get_config_value( config_file_context, key );
        if ( NULL == *out_value )
        {
            retVal = -1;
            if ( is_required )
            {
                printf( "Could not find an entry for \"%s\" key in configuration file\n",
                        key );
            }
        }
    }

    return retVal;
}

/* @brief helper function. checks to if wifi credentials are of the right size
 * and type to match simplielink API
 *
 * @param wifi_ssid The wifi network name.
 * @param wifi_ssid The wifi password
 * @param wifi_ssid a string that represents the suffix of one of the valid
 * simplelink enumerated types. For instance "wpa" would be mapped to
 * SL_WLAN_SEC_TYPE_WPA.  This check is done in mapWifiSecurityTypeStringToInt().
 * @retval 0 if parameters are valid, -1 otherwise.
 */
int8_t validateWifiConfigurationVariables( const char* wifi_ssid,
                                           const char* wifi_password,
                                           const char* wifi_security_type )
{
    int8_t retVal = 0;

    /* SSID / wifi name checks */
    if ( strlen( wifi_ssid ) > SSID_LEN_MAX )
    {
        retVal = -1;
        printf( ". \"%s\" string is too long for CC3220 wifi configuration: \"%s\"\n\r",
                WIFI_SSID_KEY, wifi_ssid );
        printf( ". Max String Length is: %d\n\r", SSID_LEN_MAX );
    }

    /* wifi password checks */
    if ( strlen( wifi_password ) > WIFI_KEY_LEN_MAX )
    {
        retVal = -1;
        printf( ". Value for \"%s\" string is too big: \"%s\"\n\r", WIFI_SSID_KEY,
                wifi_password );
        printf( ". Please reconfigure WIFI_KEY_LEN_MAX in xively_example.h to increase "
                "the buffer size\n\r" );
        printf( ". Max String Length is: %d\n\r", WIFI_KEY_LEN_MAX );
    }

    /* Security type enum checks */
    int8_t wifi_security_type_enum =
        mapWifiSecurityTypeStringToInt( ( const char* )wifi_security_type );
    if ( wifi_security_type < 0 )
    {
        retVal = -1;
        printf( ". Could not find valid \"%s\" ", WIFI_SEC_TYPE_KEY );
        printf( " in xively configuration file \"%s\"\n\r", XIVELY_CFG_FILE );
    }

    if ( 0 == strcmp( wifi_ssid, WIFI_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        retVal = -1;
        printf( ". Default WiFi SSID field entry found.\n\r" );
        printf( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
    }

