xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
    if ( 0 == strcmp( wifi_password, WIFI_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        retVal = -1;
        printf( ". Default WiFi Password field entry found.\n\r" );
        printf( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
    }

    return retVal;
}

/* @brief helper function. checks to if key's value string will fit into our Application
 * Control Block
 *
 * @param config_key the key string that was used to lookup the value in the config file.
 * This is only used for logging purposes.
 * @param value the value string that will be stored as a Xively Credential.  This
 * function
 * checks to make sure that the value will fit in the Application Control Blocks buffers
 * for Xively Credentials before a copy is made.
 * @retval 0 if the credentials are of a valid size, -1 otherwise.
 * */
int8_t validateXivelyCredentialBufferRequirement( const char* const config_key,
                                                  const char* value )
{
    if ( NULL == value )
    {
        printf( ". Key \"%s\" is missing a value in the configuration file: \"%s\"\n\r",
                config_key, value );
        return -1;
    }

    if ( 0 == strcmp( value, XIVELY_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        printf( ". \"%s\" value's is still the default value.\n\r", config_key );
        printf( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
        return -1;
    }

    if ( strlen( value ) > XIVELY_CRED_LEN_MAX )
    {
        printf( ". \"%s\" value's string is too long for internal buffer configuration. "
                "value is: \"%s\"\n\r",
                config_key, value );
        printf( ". Max String Length is: %d\n\r", XIVELY_CRED_LEN_MAX );
        return -1;
    }

    return 0;
}

/* @brief Attempts to match the string from the configuration file to an enumeration
 * the platform's SDK wlan.h file.  The most common LAN types are supported
 * out of the box. The more uncommong lans haven't been tested again
 * but in theory could be enabled.
 * @retval one of the SL_WLAN_SEC_TYPE values as defined in wlan.h, or
 * -1 if the mapping failed.
 */
int8_t mapWifiSecurityTypeStringToInt( const char* security_type )
{
    if ( NULL == security_type )
    {
        printf( "Now Wifi Security Type String found in configuration file!\n\r" );
        return -1;
    }

    if ( strcmp( "open", security_type ) == 0 || strcmp( "OPEN", security_type ) == 0 )
    {
        return SL_SEC_TYPE_OPEN;
    }

    if ( strcmp( "wep", security_type ) == 0 || strcmp( "WEP", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WEP;
    }

    if ( strcmp( "wpa", security_type ) == 0 || strcmp( "WPA", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WPA;
    }

    if ( strcmp( "wpa2", security_type ) == 0 || strcmp( "WPA2", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WPA_WPA2;
    }

    if ( strcmp( "wpa_ent", security_type ) == 0 ||
         strcmp( "WPA_ENT", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WPA_ENT;
    }

    /* potential future support based on CC3220 SDK:
     *
     * SL_SEC_TYPE_WPS_PBC
     * SL_SEC_TYPE_WPS_PIN
     * SL_SEC_TYPE_P2P_PBC
     * SL_SEC_TYPE_P2P_PIN_KEYPAD
     * SL_SEC_TYPE_P2P_PIN_DISPLAY
     * SL_SEC_TYPE_P2P_PIN_AUTO
     */
    printf( "Unsupported Wifi security type: \"%s\"\n\r", security_type );
    return -1;
}

/*****************************************************************************
 * These functions are from the ent_wlan example of the CC3200 SDK. They exist in this
 * project to facilitate state tracking of the WiFi connection for the device and are not
 * Xively specific.
 *
 * If you would like more information and documentation on these functions, please see the
 *source code in the directory example/ent_wlan of your CC3200 SDK installation.
 ******************************************************************************/
void SimpleLinkWlanEventHandler( SlWlanEvent_t* pWlanEvent )
{
    if ( !pWlanEvent )
    {
        return;
    }

    switch ( pWlanEvent->Event )
    {
        case SL_WLAN_CONNECT_EVENT:
        {
            SET_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );

            // Copy new connection SSID and BSSID to global parameters
            memcpy( g_ucConnectionSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_name,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_len );
            memcpy( g_ucConnectionBSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.bssid,
                    SL_BSSID_LENGTH );

            XIVELY_DEMO_PRINT( "[WLAN EVENT] STA Connected to the AP: %s , "
                               "BSSID: %x:%x:%x:%x:%x:%x\n",
                               g_ucConnectionSSID, g_ucConnectionBSSID[0],
                               g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                               g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                               g_ucConnectionBSSID[5] );
        }
        break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            slWlanConnectAsyncResponse_t* pEventData = NULL;

            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );
            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_IP_AQUIRED );

            pEventData = &pWlanEvent->EventData.STAandP2PModeDisconnected;

            /* If the user has initiated 'Disconnect' request,
             * 'reason_code' is SL_WLAN_DISCONNECT_USER_INITIATED_DISCONNECTION */
            if ( SL_USER_INITIATED_DISCONNECTION == pEventData->reason_code )
            {
                XIVELY_DEMO_PRINT( "[WLAN EVENT]Device disconnected from the AP: %s, "
                                   "BSSID: %x:%x:%x:%x:%x:%x on application's request \n",
                                   g_ucConnectionSSID, g_ucConnectionBSSID[0],
                                   g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                                   g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                                   g_ucConnectionBSSID[5] );
            }
            else
            {
                XIVELY_DEMO_PRINT( "[WLAN ERROR]Device disconnected from the AP AP: %s,"
                                   "BSSID: %x:%x:%x:%x:%x:%x on an ERROR..!! \n",
                                   g_ucConnectionSSID, g_ucConnectionBSSID[0],
                                   g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                                   g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                                   g_ucConnectionBSSID[5] );
            }
            memset( g_ucConnectionSSID, 0, sizeof( g_ucConnectionSSID ) );
            memset( g_ucConnectionBSSID, 0, sizeof( g_ucConnectionBSSID ) );
        }
        break;

        default:
        {
            XIVELY_DEMO_PRINT( "[WLAN EVENT] Unexpected event [0x%x]\n",
                               pWlanEvent->Event );
        }
        break;
    }
}

void SimpleLinkNetAppEventHandler( SlNetAppEvent_t* pNetAppEvent )
{
    if ( !pNetAppEvent )
    {
        return;
    }

    switch ( pNetAppEvent->Event )
    {
        case SL_NETAPP_IPV4_IPACQUIRED_EVENT:
        {
            SlIpV4AcquiredAsync_t* pEventData = NULL;

