xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
    /* Set PM policy to normal */
    lRetVal = sl_WlanPolicySet( SL_POLICY_PM, SL_NORMAL_POLICY, NULL, 0 );
    ASSERT_ON_ERROR( lRetVal );

    /* Unregister mDNS services */
    lRetVal = sl_NetAppMDNSUnRegisterService( 0, 0 );
    ASSERT_ON_ERROR( lRetVal );

    /* Remove  all 64 filters (8*8) */
    memset( RxFilterIdMask.FilterIdMask, 0xFF, 8 );
    lRetVal = sl_WlanRxFilterSet( SL_REMOVE_RX_FILTER, ( _u8* )&RxFilterIdMask,
                                  sizeof( _WlanRxFilterOperationCommandBuff_t ) );
    ASSERT_ON_ERROR( lRetVal );

    lRetVal = sl_Stop( SL_STOP_TIMEOUT );
    ASSERT_ON_ERROR( lRetVal );

    InitializeAppVariables();

    return lRetVal; /* Success */
}

static void BoardInit( void )
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS


/* Set vector table base */
#if defined( ccs )
    MAP_IntVTableBaseSet( ( unsigned long )&g_pfnVectors[0] );
#endif
#if defined( ewarm )
    MAP_IntVTableBaseSet( ( unsigned long )&__vector_table );
#endif
#endif

    /* Enable Processor */
    MAP_IntMasterEnable();
    MAP_IntEnable( FAULT_SYSTICK );

    PRCMCC3200MCUInit();
}

void WaitForWlanEvent()
{
    /* Wait for WLAN Event */
    while ( ( !IS_CONNECTED( g_ulStatus ) ) || ( !IS_IP_ACQUIRED( g_ulStatus ) ) )
    {
        /* Toggle LEDs to Indicate Connection Progress */
        _SlNonOsMainLoopTask();
        MAP_UtilsDelay( 2000000 );
        GPIO_IF_LedOn( MCU_ALL_LED_IND );
        _SlNonOsMainLoopTask();
        MAP_UtilsDelay( 2000000 );
        GPIO_IF_LedOff( MCU_ALL_LED_IND );
    }
}
